In [4]:
import pandas as pd
import numpy as np

df = pd.DataFrame( {"groups" : ["a","b","c","a","b","c"],
                   "var1" : [10,20,30,40,50,60],
                   "var2" : [101,202,303,404,505,606]},
                    columns= ["groups","var1","var2"] )

In [5]:
df

  groups  var1  var2
0      a    10   101
1      b    20   202
2      c    30   303
3      a    40   404
4      b    50   505
5      c    60   606

In [7]:
df.apply(np.sum)

groups    abcabc
var1         210
var2        2121
dtype: object

In [9]:
df = pd.DataFrame( {"groups" : ["a","b","c","a","b","c"],
                   "var1" : [10,20,30,40,50,60],
                   "var2" : [101,202,303,404,505,606]},
                    columns= ["groups","var1","var2"] )

In [10]:
df.groupby("groups").apply(np.sum)

       groups  var1  var2
groups
a          aa    50   505
b          bb    70   707
c          cc    90   909

In [11]:
df.groupby("groups").apply(np.mean)

C:\ProgramData\Anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3438: FutureWarning: In a future version, DataFrame.mean(axis=None) will return a scalar mean over the entire DataFrame. To retain the old behavior, use 'frame.mean(axis=0)' or just 'frame.mean()'
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
C:\ProgramData\Anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3438: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)

        var1   var2
groups
a       25.0  252.5
b       35.0  353.5
c       45.0  454.5